{
  "url": "https://www.bbc.com/news/articles/c179e5v552ko?at_medium=RSS&at_campaign=rss",
  "full_text": "Israeli strikes in Yemen kill 35 people, Houthis say At least 35 people were killed in Israeli air strikes on Houthi-controlled areas of Yemen on Wednesday, according to the Iran-backed group's health ministry. The Israeli military said it struck military targets in the capital Sanaa and al-Jawf province, including what it called \"the Houthis' military public relations headquarters\", in response to recent missile and drone attacks on Israel. However, the Houthis' military spokesman said the targets were civilian, adding that journalists and passersby were killed when the offices of two newspapers were hit. In the early hours of Thursday, the Israeli military said it had intercepted a missile launched from Yemen. The Houthis did not comment on the launch, but one of the group's leaders had vowed to respond to the Israeli strikes \"with all our might\". Last month, an Israeli strike in Sanaa killed the prime minister of the Houthi-run government, Ahmed al-Rahawi, and several ministers. Houthis confirm their prime minister killed in Israeli strike Israel hits Yemen's Houthis after reports group used cluster bomb Videos posted online on Wednesday afternoon showed plumes of black smoke rising from the sites of several explosions in Sanaa, and first responders searching through the rubble of damaged buildings. The Israel Defense Forces (IDF) announced in a statement that aircraft had struck an unspecified number of military targets in the capital and in al-Jawf, including military camps, a fuel storage facility and what it called the Houthis' \"public relations department\". It said the department was \"responsible for distributing and disseminating propaganda messages in the media, including speeches of the Houthi leader Abdul Malik [al-Houthi] and the spokesman Yahya Sarea's statements\". The military camps had been used to plan attacks on Israel, it added. Those attacks have involved the launch of hundreds of unmanned aerial vehicles (UAV) and surface-to-surface missiles towards Israeli territory over almost two years. Most have been intercepted, but one drone hit an airport in southern Israel on Sunday, wounding one person. \"Several days ago, we eliminated most of the members of the terrorist Houthi government. In response, the Houthis fired two days ago at the Ramon airport,\" Israeli Prime Minister Benjamin Netanyahu said during an event in Bat Yam, in central Israel. \"This did not weaken our resolve - we struck them again today from the air, their terror facilities, their terror bases with a great number of terrorists, and other facilities as well. We will continue to strike. Whoever strikes us, whoever attacks us - we will reach them.\" Houthi military spokesman Yahya Sarea said its air defences had engaged the Israeli aircraft and denied that missile launch sites were hit. \"[Israel's] strikes targeted purely civilian targets,\" he said. The group's Al-Masirah TV reported that the strikes in Sanaa had hit a medical station in the city's south-west, the Moral Guidance Directorate's headquarters in the central al-Tahrir neighbourhood, and the offices of the newspapers 26 September and Yemen, which it said caused casualties and extensive damage to nearby homes and shops. The channel also said there were strikes on a government complex and a branch of the central bank in the city of al-Hazm, in al-Jawf province. A spokesman for the health ministry, Dr Anees al-Asbahi, said on Wednesday evening that 28 people were killed and 113 injured in Sanaa, and that another seven people were killed and 18 injured in al-Jawf. He added that the death toll was likely to increase because first responders were still searching for missing people under the rubble of destroyed buildings. The head of Yemen's Houthi Supreme Political Council, Mahdi al-Mashat, said: \"The Zionist aggression against our country has failed.\" \"All Israelis must remain on high alert, as retaliation is inevitable. The attack has only given us a greater opportunity to respond with full force,\" he warned. The Houthis have controlled much of north-western Yemen since they ousted the country's internationally recognised government from there 10 years ago, sparking a civil war. They began attacking Israel and international shipping in the southern Red Sea and the Gulf of Aden shortly after the start of the war between Israel and Hamas in Gaza in October 2023, saying they were acting in support of the Palestinians. Israel has carried out many rounds of air strikes against the Houthis in retaliation for the hundreds of missiles and drones that have been launched at the country from Yemen. The US and UK have also carried out air strikes in Houthi-controlled Yemen in response to the Houthis' attacks on dozens of merchant vessels.",
  "summary": "The Israeli military says it hit military targets, but the Houthis say only civilian sites were targeted.",
  "timestamp": "2025-09-12T15:55:31.812638"
}