{
  "url": "https://www.bbc.com/news/articles/ckgqdz17ye3o?at_medium=RSS&at_campaign=rss",
  "full_text": "North Korea executing more people for watching foreign films and TV, UN finds The North Korean government is increasingly implementing the death penalty, including for people caught watching and sharing foreign films and TV dramas, a major UN report has found. The dictatorship, which remains largely cut off from the world, is also subjecting its people to more forced labour while further restricting their freedoms, the report added. The UN Human Rights Office found that over the past decade the North Korean state had tightened control over \"all aspects of citizens' lives\". \"No other population is under such restrictions in today's world,\" it concluded, adding that surveillance had become \"more pervasive\", helped in part by advances in technology. The UN High Commissioner for Human Rights, Volker Türk, said that if this situation continued, North Koreans \"will be subjected to more of the suffering, brutal repression and fear that they have endured for so long\". The report, which is based on more than 300 interviews with people who escaped from North Korea in the past 10 years, found that the death penalty is being used more often. At least six new laws have been introduced since 2015 that allow for the penalty to be handed out. One crime which can now be punished by death is the watching and sharing of foreign media content such as films and TV dramas, as Kim Jong Un works to successfully limit people's access to information. Escapees told UN researchers that from 2020 onwards there had been more executions for distributing foreign content. They described how these executions are carried out by firing squads in public to instil fear in people and discourage them from breaking the law. Kang Gyuri, who escaped in 2023, told the BBC that three of her friends were executed after being caught with South Korean content. She was at the trial of one 23-year-old friend who was sentenced to death. \"He was tried along with drug criminals. These crimes are treated the same now,\" she said, adding that since 2020 people had become more afraid. Such experiences run counter to what North Korean people had expected from the past decade. When the current leader Kim Jong Un came to power in 2011, the escapees who were interviewed said they had hoped their lives would improve, as Kim had promised they would no longer need to \"tighten their belts\" – meaning they would have enough to eat. He promised to grow the economy, while also protecting the country by further developing its nuclear weapons. But the report found that since Kim shunned diplomacy with the West and the US in 2019, instead focusing on his weapons programme, people's living situations and human rights had \"degraded\". Almost everyone interviewed said they did not have enough to eat, and having three meals a day was a \"luxury\". During the Covid pandemic, many escapees said there had been a severe lack of food, and people across the country died of hunger. At the same time, the government cracked down on the informal marketplaces where families would trade, making it harder for them to make a living. It also made it nearly impossible to escape from the country, by tightening controls along the border with China and ordering troops to shoot those trying to cross. \"In the early days of Kim Jong Un, we had some hope, but that hope did not last long,\" said one young woman who escaped in 2018 at the age of 17. \"The government gradually blocked people from making a living independently, and the very act of living became a daily torment,\" she testified to researchers. The UN report said that \"Over the past 10 years the government has exercised near total control over people, leaving them unable to make their own decisions\" - be they economic, social or political. The report added that improvements in surveillance technology had helped make this possible. One escapee told researchers these government crackdowns were intended \"to block people's eyes and ears\". \"It is a form of control aimed at eliminating even the smallest signs of dissatisfaction or complaint,\" they said, speaking anonymously. The report also found the government is using more forced labour than it was a decade ago. People from poor families are recruited into \"shock brigades\" to complete physically demanding tasks, such as construction or mining projects. The workers hope this will improve their social status, but the work is hazardous, and deaths are common. Rather than improve workers' safety, however, the government glorifies deaths, labelling them as a sacrifice to Kim Jong Un. In recent years it has even recruited thousands of orphans and street children, the report claims. This latest research follows a groundbreaking UN commission of inquiry report in 2014, which found, for the first time, that the North Korean government was committing crimes against humanity. Some of the most severe human rights violations were discovered to be taking place at the country's notorious political prison camps, where people can be locked up for life and \"disappeared\". This 2025 report finds that at least four of these camps are still operating, while detainees in regular prisons are still being tortured and abused. Many escapees said they had witnessed prisoners die from ill treatment, overwork and malnutrition, though the UN did hear of \"some limited improvements\" at the facilities, including \"a slight decrease in violence by guards\". The UN is calling for the situation to be passed to the International Criminal Court in the Hague. However, for this to happen, it would need to be referred by the UN Security Council. Since 2019, two of its permanent members, China and Russia, have repeatedly blocked attempts to impose new sanctions on North Korea. Last week, Kim Jong Un joined the Chinese leader Xi Jinping and the Russian President Vladimir Putin at a military parade in Beijing, signalling these countries' tacit acceptance of North Korea's nuclear weapons programme and treatment of its citizens. As well as urging the international community to act, the UN is asking the North Korean government to abolish its political prison camps, end the use of the death penalty and teach its citizens about human rights. \"Our reporting shows a clear and strong desire for change, particularly among (North Korea's) young people,\" said the UN human rights chief, Mr Türk. North Koreans tell BBC they are being sent to work 'like slaves' in Russia A family's escape from North Korea through a minefield and stormy seas North Korea sent me abroad to be a secret IT worker. My wages funded the regime North Korea's Benidorm-style resort welcomes first Russian tourists",
  "summary": "The report is based on more than 300 interviews with escapees from Kim Jong Un's secretive regime.",
  "timestamp": "2025-09-12T15:55:29.642626"
}