{
  "url": "https://www.bbc.com/news/videos/cwy9jrdg4qro?at_medium=RSS&at_campaign=rss",
  "full_text": "See Kathmandu's destroyed and barricaded streets after violence There's a \"real sense of tension\" in Kathmandu, the BBC's Samira Hussain says, after protests against corruption spiralled into arson and violence. Nepal's army deployed patrols on the streets, as the Himalayan nation reeled from its worst unrest in decades. The prime minister quit and politicians' homes were vandalised, and government buildings and parliament were torched. The streets of Nepal's capital have a heavy military presence, with barricades erected outside parliament and the supreme court. Watch: Key moments from China's big show of strength The military parade was attended by world leaders including Vladimir Putin and Kim Jong Un and showcased China’s new weapons. Watch: New ICBM missile on display at China's military parade During the parade, China unveiled an intercontinental strategic nuclear missile known as the DF-5C. Watch: China's military parade begins with gun salute Troops marched in Tiananmen Square to showcase China's military strength in an event marking 80 years since Japan surrendered in WW2. Afghan quake victims buried on mountain top as aftershocks continue The BBC's Yama Bariz travelled to a region devastated by the 6.0 magnitude earthquake. Watch: Buildings destroyed and rescue efforts under way after deadly Afghanistan earthquake At least 800 people have been killed and thousands injured in the east of the country after a 6.0 magnitude earthquake struck on Sunday night. BBC reports from scene as Afghanistan earthquake rescue mission gets under way Rescuers are having to travel by helicopter to the worst-hit areas, as they have been cut off by the earthquake. Watch: Luxury neighbourhood in Lahore submerged in floods Watch: Luxury neighbourhood in Lahore submerged in floods How Tokyo is using AI video to prepare for a Mt Fuji eruption Tokyo authorities say they released the AI-generated video to raise awareness and help people prepare for disaster - but how likely is Mt Fuji to actually erupt? Watch: Raging rivers cause destruction in parts of northern India At least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes. Watch: World's highest bridge completes key load-bearing test Some 96 trucks were driven on China's Huajiang Grand Canyon Bridge in a test ahead of the scheduled opening next month. Hongkongers squawk-off in city's first bird call contest Bird lovers dressed up and took to the stage to mimic rhythmic calls in a competition aimed at promoting conservation awareness. Watch: Moment fireball lights up night sky in Japan The skies above southern Japan were illuminated late on Tuesday evening after dust or asteroid fragments burnt up in the atmosphere. Watch: Competitors walk slackline 400m above Chinese gorge Participants walked between two peaks more than a kilometre apart on a slackline just 2cm wide. 'The danger is not over in Pakistan' after flash floods Emergency teams searching for the missing are struggling through mud and debris, following flash flooding in Khyber Pakhtunkhwa province. Watch: Destruction in Pakistan after flash floods that have killed hundreds The majority of fatalities were recorded in the northwest Buner district, where at least 200 people were killed. Stranded passengers make precarious railway walk Passengers had to walk high above the ground to get back to the Singapore station after a power fault. Watch robot athletes compete in world's first humanoid games Teams from 16 countries are competing in a range of sports including football, athletics and dance as part of the World Humanoid Robot Games in Beijing, China. Watch: Jimmy Lai's last interview as a free man in 2020 The BBC's Danny Vincent spoke to the pro-democracy tycoon just hours before his arrest in December 2020. How does Japan remember the end of WW2? In Japan,15 August is a mourning occasion known as \"Memorial Day for the End of the War\" Flash floods hit villages in northern India and Indian-administered Kashmir Dozens of people have died as a result of the floodwaters, while others are feared missing.",
  "summary": "There's an intense military presence on the Nepali capital's streets, says the BBC's Samira Hussain. \n",
  "timestamp": "2025-09-12T15:55:34.211299"
}