{
  "url": "https://www.bbc.com/news/videos/cly0d2dk2gpo?at_medium=RSS&at_campaign=rss",
  "full_text": "Watch: Video shows moment Kirk shooting suspect flees the scene Utah authorities have released CCTV footage showing the Charlie Kirk shooting suspect fleeing the scene at Utah Valley University. The video shows a figure dressed in black running across a roof before dropping down to the ground and fleeing towards a wooded area. Authorities say the suspect was wearing Converse shoes, sunglasses and a \"distinctive\" black T-shirt with an American flag and an eagle. Watch: Key moments from RFK Jr's heated Senate hearing The US health secretary faced questions on Covid deaths and vaccines a week after firing the head of the Centers for Disease Control and Prevention. Watch: Epstein accusers speak outside US Capitol The group said they are making their own list of Jeffrey Epstein's associates and called for the release of all files related to the investigation. Wildfire ravages historic California gold rush town destroying homes A fast-moving wildfire scorched the historic gold rush town of Chinese Camp destroying at least five homes and prompting evacuations. Watch: Fountains of lava shoot into the air as Kilauea erupts The molten magma streamed down one of the world’s most active volcanoes and put on another fiery show on the Island of Hawaii. 'I would feel more worried' - Chicagoans on Trump's plan to deploy troops President Donald Trump says he will send the National Guard to Chicago to help fight crime but has not specified when that could occur. Watch: Moment police device breaks off fleeing car's rear axle Officers in Michigan were responding to reports of a stolen vehicle, when they deployed a grappler device around one of the car's tires. Trump addresses online health rumours in Oval Office In response to a reporter's question, the president said he was ‘very active’ over the Labor Day weekend. 'We love you, you will always be with us', says father of Minneapolis shooting victim Fletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis. Watch: Timelapse shows massive clouds of smoke from California wildfire The Garnet wildfire in Fresno County has scorched nearly 14,000 acres (5,665 hectares) and remains uncontained. Watch: BBC interviews man who helped rescue children from gunfire The BBC's Tom Bateman spoke with Patrick Scallen who lives near the Annunciation Church and ran towards the sound of gunfire. Watch: Moment pilot is rescued after emergency water landing New drone video shows rescuers rushing to the small plane off the coast of North Carolina and extracting the pilot in less than 30 seconds. Watch: How the Catholic school shooting unfolded in Minneapolis Two children, aged eight and 10, have been killed and 17 other people injured following a shooting during Mass. Watch: SpaceX Starship completes successful test flight Elon Musk's giant rocket, earmarked for use in a 2027 mission to the Moon, has had multiple catastrophic failures in previous launches. Watch: 'Please give me an invite' - Americans react to Taylor Swift's engagement Swift, who has been in a relationship with Travis Kelce for two years, shared the news less than two weeks after announcing a new album. Watch: Moment massive dust storm surges through Arizona The wall of dust known as a haboob was propelled by thunderstorm winds through parts of Arizona's Pinal County. Watch: Wildfire threatens California's famed wine country in Napa Valley The Pickett Fire has scorched more than 6,800 acres (2,752 hectares), as a second major fire also burns in Oregon. Watch: Supporters rally as Abrego Garcia is detained The Salvadoran man was detained by ICE as a possible second deportation looms. Hawaii's Kilauea volcano erupts creating lava fountain Kilauea, on Hawaii's Big Island, started spewing fresh lava on 22 August, the Hawaiian Volcano Observatory said. Why has Gavin Newsom gone 'dark woke'? The BBC explains The California governor is using President Trump's notable social media playbook and turning it on Republicans. Watch: How the FBI raids on John Bolton's home and office unfolded The former national security adviser has become a vocal critic of President Donald Trump since serving in his first administration.",
  "summary": "The video shows a figure dressed in black dropping from a roof at the Utah campus and fleeing towards a wooded area. ",
  "timestamp": "2025-09-12T15:55:33.693491"
}