{
  "url": "https://www.bbc.com/news/articles/c07vkln2ezro?at_medium=RSS&at_campaign=rss",
  "full_text": "South Sudan vice-president charged with murder and treason South Sudan's First Vice-President Riek Machar has been charged with murder, treason and crimes against humanity in a move that some fear could reignite the country's civil war. Justice Minister Joseph Geng Akech said the charges against Machar relate to an attack in March by a militia allegedly linked to the vice-president, which killed 250 soldiers and a general. Machar's spokesperson has condemned the move as a \"political witch-hunt\". The roads leading to Machar's house in the capital, Juba, have been blocked by tanks and soldiers. Forces loyal to Machar fought a five-year civil war against those backing President Salva Kiir until a 2018 peace deal ending the fighting in the world's newest country. Machar has been under house arrest since March, with the UN, African Union and neighbouring countries all calling for calm. The 2018 peace deal ended the conflict that had killed nearly 400,000 people, however the relationship between Machar and Kiir has become increasingly strained amid ethnic tensions and sporadic violence. Seven others have been charged alongside Machar, including Petroleum Minister Puot Kang Chol and Army Deputy Chief of Staff Lt Gen Gabriel Duop Lam, Justice Minister Joseph Geng Akech said in a statement. They are all Machar allies who were arrested at the same time as him and have also been in detention ever since. Another 13 suspects remain at large, the minister said. Machar and Chol have also been suspended from their government roles, according to an announcement on state TV. Machar's spokesperson Puok Both Baluang said the whole crisis had been fabricated by Kiir's allies and was \"designed to dismantle the peace agreement\". He further said that South Sudan's judicial system was not independent, \"operating instead as politically directed courts\". The March attack was carried out by the White Army militia, largely made up of fighters from the Nuer ethnic group, the same as Machar, long-time rivals of Kiir's Dinka community. The White Army overran an army base in the north-eastern town of Nasir. A UN helicopter also came under fire, leading to the death of its pilot. \"This case sends a clear message: those who commit atrocities against the people of South Sudan, against our armed forces, and against humanitarian personnel will be held accountable, no matter their position or political influence,\" the justice minister said. He added that as the matter was now before the courts, it should not be subject to political or diplomatic debate until a judicial pronouncement is made. Machar has not commented on the allegation that he was behind the attack. South Sudan gained its independence from Sudan in 2011 following decades of conflict which devastated the country. But within two years, civil war broke out. You may also be interested in: Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica",
  "summary": "The roads leading to Riek Machar's house are blocked by tanks and soldiers, amid fears of renewed fighting.",
  "timestamp": "2025-09-12T15:55:30.389932"
}