{
  "url": "https://www.bbc.com/news/articles/cq65ygpv7p1o?at_medium=RSS&at_campaign=rss",
  "full_text": "South African rapist loses bid to block Netflix film about his life Convicted South African rapist Thabo Bester has lost a court bid to block Netflix from broadcasting a documentary about his life - including how he allegedly faked his death and escaped from prison. His lawyers argued that Beauty and the Bester was defamatory, but the streaming giant defended its plan to release the three-part investigation. Bester's partner, celebrity doctor Nandipha Magudumana, features in the documentary, having allegedly helped him escape. She was part of the court bid to halt the release. In a court ruling on Friday, a judge said the rape case was \"firmly in the public domain\" and that they had failed to prove that their petition was urgent. She however said that the pair would still be free to sue for defamation if they wished, after the documentary airs. It is due to be released later on Friday. Bester was convicted in 2012 for the rape and murder of his model girlfriend Nomfundo Tyhulu. A year earlier, he was found guilty of raping and robbing two other women. Bester became known as the \"Facebook rapist\" for using the social networking site to lure his victims. He was serving a life sentence when he allegedly escaped from a maximum security prison in 2022. A fire broke out in prison, with the authorities finding a charred body that they thought was Bester's. However, it turned out to be that of another person. Undetected for a year, Bester then allegedly lived under an alias in South Africa's main city, Johannesburg, helped by his partner. The pair were arrested while on the run in the East African state of Tanzania in April 2023, and were deported. They are currently in custody, awaiting trial on several charges - including violating a corpse, defeating the ends of justice and fraud. They have not yet pleaded to the charges. The two had petitioned the court to halt the much-anticipated Netflix documentary, saying it infringed their right to a fair trial. Handing down judgment on Friday, Judge Sulet Potterill said the applications lacked urgency, terming it a \"self-created urgency\". The judge said Bester and Magudumana had ample time to launch their applications and \"waited until the last minute\" to file it as urgent. But the court ruled that it was open to hear their substantive redress, including suing for defamation, as the case law was clear about that. \"A defamation claim can be instituted and damages sought. I cannot find in any way that the screening of the utterances they find to make the doctor guilty affects her right to a fair trial,\" the judge ruled. More about South Africa from the BBC: Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica",
  "summary": "Thabo Bester had argued the documentary would affect his trial for allegedly faking his death to escape prison.",
  "timestamp": "2025-09-12T15:55:29.805611"
}