{
  "url": "https://www.bbc.com/news/articles/cr5q28n7e06o?at_medium=RSS&at_campaign=rss",
  "full_text": "Schools shut in two Dutch towns over youth violence and abuse videos Secondary schools in two neighbouring towns in the Netherlands were told to shut on Friday because of a spate of violence involving two groups of young people. All five schools in Beverwijk and Heemskerk have been closed in a bid to restore calm after images circulated of teenagers being attacked, along with AI-generated videos showing fake explosions at two schools. Beverwijk Mayor Martijn Smit has issued a three-day emergency order, banning all gatherings of three or more people and designating areas as \"high-risk\" to prevent potential gun use. \"Parents were worried about their children going into school,\" Smit told NOS Radio, \"so it was wisest to have a day of calm and then go back on Monday.\" Two rival groups of youths have been blamed for the escalating violence, which apparently began with serious damage caused to a school in Beverwijk last week. Police said a 22-year-old man had been arrested on suspicion of vandalism. Fighting then broke out and a boy was seriously hurt. One unverified TikTok video has emerged showing the boy being kicked in the head with his mouth covered in tape. The mayor said people were scared and that \"very nasty videos\" were being shared involving abuse of young people, adding: \"People's pants are being ripped off, their genitals are being filmed and posted online - and really I think that's enough.\" Dutch Justice Minister Foort van Oosten said it was \"incredibly sad that the schools have had to decide to do this\" as it was children's right to go to school. Police said in a statement that they were working to \"restore calm and ensure safety in the area\", and had the authority under the emergency orders from the mayors of Beverwijk and Heemskerk to conduct preventative searches and order groups to disperse. Sports clubs have cancelled evening training sessions, with the local DEM club saying that was when disturbances were taking place. \"It's difficult to imagine this going on in normal life,\" said the leader of the BBB farmer-citizen movement Caroline de Plas. \"We're going completely crazy.\"",
  "summary": "All five secondary schools in Beverwijk and Heemskerk are closed in a bid to restore calm.",
  "timestamp": "2025-09-12T15:55:29.688702"
}