{
  "url": "https://www.bbc.com/news/articles/cdxqnkwerj7o?at_medium=RSS&at_campaign=rss",
  "full_text": "Charlie Kirk: Conservative influencer who rallied a youth movement Charlie Kirk was one of the highest profile conservative activists and media personalities in the US, and a trusted ally of President Donald Trump. He was shot dead on Wednesday at the age of 31 while hosting a college event for Turning Point USA, the organisation he co-founded, in what police are calling a targeted shooting. President Donald Trump announced the shocking news of Kirk's death, paying tribute on Truth Social: \"The Great, and even Legendary, Charlie Kirk, is dead. No one understood or had the Heart of the Youth in the United States of America better than Charlie.\" Kirk was seen as both the future of conservative activism - as well as a highly polarising figure. Who was Charlie Kirk? The son of an architect who grew up in the well-to-do Chicago suburb of Prospect Heights, Kirk attended an Illinois community college before dropping out to devote himself to political activism. He also applied unsuccessfully for West Point, the elite US military academy. Kirk often referred tongue-in-cheek to his lack of a college degree when debating students and academics on esoteric topics such as post-modernism. He was an avid public speaker, touring the country addressing Republican events, many of which were popular with members of the ultra-conservative Tea Party movement, and his daily talk radio show had millions of followers on social media. Turning Point, which he started at age 18, aimed to spread conservative ideals at liberal-leaning US colleges. The event on Wednesday at Utah Valley University, where he was gunned down, was the first stop on a planned 15-event \"American Comeback Tour\" of college campuses, where attendees were invited to argue with Kirk. What did Charlie Kirk stand for? His social media and his eponymous daily podcast often offered clips of him debating with students about issues like climate change, faith and family values. Kirk's comments on gender, race and politics often drew fierce liberal criticism. His opposition to gun control was among issues he discussed. A few months ago, he said: \"It's worth it to have a cost of, unfortunately, some gun deaths every single year so that we can have the Second Amendment\". A clip of Trump himself plays at the beginning of Kirk's podcast: \"I want to thank Charlie, he's an incredible guy, his spirit, his love of this country, he's done an amazing job building one of the most powerful youth organisations ever created.\" The non-profit he founded, Turning Point USA - a large part of his legacy - began after President Barack Obama was re-elected in 2012. Its mission, aimed at young people, is to organise students to \"promote the principles of fiscal responsibility, free markets, and limited government\". It now has chapters at more than 850 colleges. It played a key role in the get-out-the-vote effort for Trump and other Republican candidates in last year's election. He was also widely credited with helping to register tens of thousands of new voters and flipping Arizona for Trump. The relationship between Kirk and Trump grew after Trump's victory, with Kirk attending Trump's inauguration in January in Washington DC. He was a regular visitor at the White House during both Trump terms in office. According to the New York Times, he played golf with Trump just two days before the president's 2025 presidential inauguration. In January he travelled with Trump's son, Donald Trump Jr, to Greenland, as the then-incoming president was arguing that the US should own the Arctic territory. Kirk also addressed the Oxford Union - a debating society at Oxford University - earlier this year, and in 2020, wrote a best-seller, The Maga Doctrine, a reference to Trump's \"Make America Great Again\" campaign. Kirk's evangelical Christianity and his young family were front and centre in his politics. He married Erika Kirk, a businesswoman and former Miss Arizona, in May 2021 and they had two children. According to her website, she is the founder of Proclaim, a faith-based clothing line, a podcast host and the founder of two non-profit organisations. She also frequently appeared by Kirk's side at public engagements. The couple regularly posted on Instagram about their family life, but kept their children's identities private. In August, Kirk posted a photo of himself at the beach as they celebrated his daughter's third birthday. Erika Kirk is currently studying for a doctorate in Bible Studies. On Wednesday, before the event at which her husband was shot, sheposted online: \"Psalm 46:1 - God is our refuge and strength, a very present help in trouble.\"",
  "summary": "Kirk, an influential Trump ally who at age 18 set up Turning Point USA, died in a shooting while speaking at a Utah campus event.",
  "timestamp": "2025-09-12T15:55:33.009168"
}