{
  "url": "https://www.bbc.com/news/articles/cderllgw84ro?at_medium=RSS&at_campaign=rss",
  "full_text": "Ukraine strikes key Russian oil terminal in massive drone attack Ukraine has struck Russia's largest oil terminal on the Baltic Sea during one of its biggest overnight drone attacks in months. The aerial assault targeted the Primorsk oil port in the Leningrad region, the final station of the Baltic Pipeline System and a crucial hub for Russia's maritime exports, Ukraine's security services told multiple outlets. More than half ofthe 221 drones sent to Russian territorywere intercepted over the Bryansk and Smolensk regions, where Lukoil facilities were also reportedly targeted, the Russian defence ministry said. Meanwhile, officials said two civilians were killed in Ukraine's Sumy region when a Russian glide bomb struck a village near the border. Authorities in the Leningrad region said 28 drones were brought down and that a fire had broken out at a vessel and a pumping station in Primorsk. They added that the blaze was extinguished without casualties or leaks. The port is also central to Russia's so-called \"shadow fleet\" of ageing tankers used to skirt international sanctions. The Ukrainian security services said drone strikes also hit several pumping stations feeding the Ust-Luga terminal, near the border with Estonia. Russian state energy firm Rosatom reported a drone attack on a power unit at its Smolensk Nuclear Power Plant, near the Belarussian border. Russian officials said drones were intercepted across at least nine other regions, including Kaluga, Novgorod and the Moscow area, where nine drones were said to have been destroyed. Debris was recorded across several areas, though authorities insisted there had been no casualties. In Bryansk, southwest of the capital, a drone hit a bus, injuring seven people, including five civilians and two military personnel, the region's Governor Alexander Bogomaz said. Operations at St Petersburg's Pulkovo airport were briefly suspended. Moscow's figures, which the BBC has been unable to independently verify, suggest Thursday night's attack constituted one of the largest Ukrainian aerial bombardments in over four months. Russia said it destroyed a record 524 drones on 7 May. By comparison, Ukrainian officials said Russia had deployed 818 drones against their territory in recent weeks. The aerial assault is being described as one of the most significant for the Leningrad region since Russia's full-scale invasion of Ukraine three-and-a-half years ago. The attack saw operations at St Petersburg's Pulkovo airport temporarily suspended. Cross-border drone raids have become an increasingly prominent feature of the war. In July, a sustained Ukrainian drone attack forced thetemporary closure of all of Moscow's airports. In recent months, Ukrainian strikes have reached deeper into Russian territory, hitting refineries, fuel depots and logistics hubs hundreds of miles from the frontlinesin a bid to limit fuel supplies and drive up costs. While these strikes have been ongoing for more than a year, they escalated sharply in August, with more than a dozen refineries hit. The damage, coupled with Western sanctions, is proving increasingly difficult to repair. During those attacks, Ukraine disabled 20% of Russia's oil refining capacity during August, the White House said last month - though Russian media has downplayed the cause of the damage, citing \"unscheduled repairs\". But Russian newspaper Moskovskij Komsomolets warned this week that petrol supplies were \"near critical\", with drivers in far eastern Russia reporting kilometre-long queues, rationing and soaring prices. Strikes have also hit the Druzhba pipeline, disrupting exports to Hungary and Slovakia - potentially cutting off a key source of foreign currency for Russia. Moscow has intensified its missile and drone attacks on Ukrainian cities and energy facilities over the summer as US-led efforts to reach a peace agreement faltered. Kremlin spokesman Dmitry Peskov told reporters on Friday that there had been a \"pause\" in peace negotiations, blaming Ukraine's European allies for \"hindering\" the process. Thursday night's attacks came ahead of the start of a major joint military exercise between Russia and ally Belarus on Friday, which is staged every four years. But this time it is taking place just days after a number of Russian drones were shot down or fell on Poland, in what Warsaw called an unprecedented incursion into its airspace. Russian air strike kills 24 in pension queue, Ukraine says Inside Kyiv government building hit by missile strike Russian air strikes get deadlier and bigger, hitting Ukraine's very heart Rosenberg: What's behind Putin's uncompromising stance on Ukraine?",
  "summary": "The overnight attack is the largest since May, but follows much larger bombardments from Russia.",
  "timestamp": "2025-09-12T15:55:29.904365"
}