{
  "url": "https://www.bbc.com/news/articles/c0lkz2n34z6o?at_medium=RSS&at_campaign=rss",
  "full_text": "Nato strengthens defences after Russian drones shot down over Poland Several Nato members are sending troops, artillery, and air defence systems to secure its eastern flank after what Poland called an unprecedented Russian drone incursion into its airspace. In the early hours of Wednesday, three Russian drones were shot down after crossing into Polish airspace. Other drones crashed to the ground and were later found across eastern Poland. Poland has requested a UN Security Council session about the incident, which will take place on Friday at 19:00 GMT. In response to the drone incursion, the Netherlands and the Czech Republic said they would send defences to Poland, while Lithuania would receive a German brigade and greater warning of Russian attacks on Ukraine that could cross over. Germany also said it would \"intensify its engagement along Nato's eastern border\" and extend and expand air policing over Poland. Later France's Emmanuel Macron announced the country would send three Rafale fighter jets to help protect Poland's airspace. \"We will not yield to Russia's growing intimidation,\" Macron said. US President Donald Trump, who has been trying unsuccessfully to broker a halt to the war in Ukraine, told reporters on Thursday that the alleged incursion might have happened by \"mistake\". \"I'm not happy about anything to do with the whole situation, but hopefully that's going to come to an end,\" Trump said. Addressing parliament on Thursday, Polish Defence Minister Wladyslaw Kosiniak-Kamysz listed the offers of support from Poland's partners, saying the Dutch were going to deploy air defence systems, artillery and 300 troops, while the Czech would send helicopters and 100 soldiers. He also said the French and the British could deploy aircraft to secure Nato's eastern flank. \"Poland has repeatedly heard words of solidarity and empty gestures throughout its history,\" Kosiniak-Kamysz said. \"Today, we have concrete declarations.\" Although Russian drones and missiles have trespassed into some Nato member countries before, this was the most serious incident of its kind since Moscow launched its full-scale invasion of Ukraine in February 2022. The Kremlin said it had no further comment to make on claims that Russia had deliberately sought to stoke tensions in Poland. Yet many Polish and European leaders believe the incursion was deliberate. \"This Russian provocation...is nothing more than an attempt to test our capabilities,\" Poland's President Karol Nawrocki said, echoing comments by his German and French counterparts. However, experts' opinions are split on whether Moscow intended to launch the drones into Poland. On Thursday, Nato's top military commander Alexus Grynkewich acknowledged it was not yet known whether the act had been intentional and said even the precise number of drones which had crossed into Polish airspace was still to be determined. But in the face of growing nervousness from the countries bordering Russia, neither Nato nor Poland are taking any chances. Warsaw will set restrictions for drones and small air traffic along its eastern borders with Belarus and Ukraine, and Latvia has announced its eastern airspace would be closed for a week. Ukraine's President Volodymyr Zelensky offered to provide guidance and training to Western military representatives on how to fend off Russian aerial attacks as Ukrainian defence forces do on a near-nightly basis. Zelensky also called for a joint air defence system to act as an air shield over Europe as a response for Russia's \"insolent\" behaviour. Adding to the anxiety felt in some quarters of eastern Europe are major joint military exercises between Belarus and Russia, dubbed Zapad 2025, due to start on Friday. Poland is due to close its border on Thursday at 00:00 local time (22:00 BST)\"for national security reasons... in connection with the Zapad manoeuvres,\" which it called \"very aggressive\". Russia has urged Polish authorities to re-open its border with Belarus, warning its closure \"will cause serious damage\" to businesses and freedom of movement. \"We call on Warsaw to think about the consequences of such destructive steps and reconsider the decision as soon as possible\", Russian foreign ministry spokeswoman Maria Zakharova said. The previous Zapad drills were staged several months before the start of the war in Ukraine and involved about 200,000 troops in total. This year's exercise will be smaller in scale, according to Lithuanian military intelligence chief Mindaugas Mazonas, and involve up to 30,000 troops in total. The response by US President Donald Trump to the drone incursion has so far been muted. \"What's with Russia violating Poland's airspace with drones? Here we go!\", he wrote on social media on Wednesday without elaborating further. Polish President Nawrocki said he and his US counterpart had spoken as \"part of a series of consultations\" with allies and said the talks \"reaffirmed our unity\". Poland says it shot down Russian drones after airspace violation Putin and Netanyahu present twin challenges to Trump's diplomacy Who is in Nato and what are Article 4 and Article 5?",
  "summary": "Germany, the Netherlands and the Czech Republic will be sending Poland more support to defend Nato's eastern flank.",
  "timestamp": "2025-09-12T15:55:30.957702"
}