{
  "url": "https://www.bbc.com/news/articles/c740mezey41o?at_medium=RSS&at_campaign=rss",
  "full_text": "Belarus frees political prisoners in exchange for easing of US sanctions Dozens of political prisoners have been freed from Belarusian prisons as part of a deal between authoritarian leader Alexander Lukashenko and US President Donald Trump. Fifty-two prisoners have been released, including trade union leaders, journalists and activists, but more than 1,000 political prisoners remain in jail. In exchange, the US has said it will relieve some sanctions on Belarusian airline Belavia, allowing it to buy parts for its airplanes. The prisoner release came on the eve of joint military exercises involving Belarus and close ally Russia, and after what neighbouring Poland called an unprecedented Russian drone incursion into its airspace. Poland is closing its borders with Belarus because of the Zapad-2025 drills, which last until Tuesday. Latvia is closing part of its airspace as well. Russia's foreign ministry condemned Poland's leadership for its \"confrontational steps\" in closing the border. Meanwhile, the EU's foreign policy chief, Kaja Kallas, told the BBC World Service's Newshour that \"Putin is mocking the efforts\" by the West to deal with him. Lukashenko, who is 71 and has led Belarus since 1994, quashing all opposition, described the release of the prisoners as a humanitarian gesture, after meeting Trump special envoy John Coale in the capital Minsk on Thursday. The two men discussed how they could re-establish a trade relationship, including reopening the US embassy in Minsk. The US closed its embassy in the capital in February 2022 after Russia's Vladimir Putin used Belarusian territory to launch his full-scale invasion of Ukraine. Coale told news agency Reuters that he did not yet have a date for the embassy's reopening but that it would happen \"in the very near future\". Belarus is eager to build an economic relationship with the US having been hit with a raft of Western sanctions because of connection to Russia's war in Ukraine. Some of the sanctions on national airline Belavia have been lifted in return for the prisoner releases, US officials say. The airline was sanctioned after Belarusian flight controllers ordered a Ryanair jet traveling from Greece to Lithuania to land in Minsk in 2021, and police then arrested journalist Roman Protasevich. Many of Belarus's political prisoners have been in jail since Lukashenko brutally stamped out protests in Belarus in 2020, after he claimed victory in presidential elections widely condemned as rigged. \"The Americans are taking a very constructive stance on the so-called political prisoners. We do not need political prisoners or any other prisoners,\" Lukashenko was quoted as saying by state news agency Belta. The 52 prisoners pardoned on Thursday join 314 others released since July 2023 in an attempt to soften Belarus's relationship with the EU and the US, according to Human Rights Watch. Another 14 prisoners were pardoned and released in June duringthe visit of a US special envoy, including Sergei Tikhanovsky, the husband of exiled Belarus opposition leader Svetlana Tikhanovskaya. Thirteen others were released and forced into exile. Tikhanovskaya met some of the released prisoners as they crossed the border into neighbouring Lithuania, where President Gitanas Nauseda thanked Trump for his efforts in freeing them. He said they had left behind \"barbed wire, barred windows and constant fear\". Among the 52 freed were 69-year-old philosopher Vladimir Matskevich, journalist Igor Losik and senior opposition figure Mikola Statkevich, who was a presidential candidate in 2010. Fellow opposition official Olga Zazulinskaya wrote on social media that their release was good news for their families and friends, but noted that they were obtaining their freedom in exchange for exile, rather than a return home. In her first words to reporters after her release, former journalist Larissa Shchyrakova said she had in fact served her entire three-year jail term - \"and now they've expelled me\". Mikola Statkevich, a veteran dissident, refused to cross into Lithuania and Belarus's exiled opposition posted pictures of him sitting in no man's land at the border. Tikhanovskaya said he had reportedly gone back to Belarus, adding: \"Every Belarusian has the right to live without repression and state terror in their own country.\" Human rights group Viasna said UK-Belarus dual citizen Julia Fenner was also among the 52 freed. The wife of a British diplomat, she was detained on the border as she entered Belarus last year and was given a long jail term last week. The BBC has asked the UK Foreign Office for confirmation. Trump indicated last month that he was talking to Lukashenko about a possible prisoner release, while he was also seeking improved relations with Putin. Although his summit with Putin met with no obvious success, Trump does appear to have secured a deal with Lukashenko, who has spent decades isolated from his European neighbours because of his authoritarian rule. I lost half my weight in jail, but I'm not broken, says freed Belarus opposition leader Belarus opposition leader's husband urges Trump to help other prisoners How Belarus dissidents in exile abroad are pursued and threatened",
  "summary": "Fifty-two prisoners have been released, but more than 1,000 political prisoners remain in jail.",
  "timestamp": "2025-09-12T15:55:30.048626"
}