{
  "url": "https://www.bbc.com/news/articles/cwy9j8xqq2yo?at_medium=RSS&at_campaign=rss",
  "full_text": "Zambia presses China for more compensation over toxic mine spill Zambia's government says it will seek more compensation for communities affected by a toxic spill from a Chinese-owned copper mine, if it is needed following a full assessment. The spill of highly acidic mine-waste laden with toxic heavy metals happened in February when a dam that held waste from the Sino-Metals Leach Zambia copper mine collapsed, polluting a key river that is a major source of drinking water. The firm apologised and pledged to compensate the victims but Zambia's Vice-President Mutale Nalumango says that \"may not be all\", adding that the safety of Zambians was \"non-negotiable\". Some embassies have warned their citizens to avoid the area due to the health risks. Sino-Metals Leach Zambia mine is a subsidiary of China Nonferrous Metal Mining Group, which is owned by the Chinese government. The company had initially reported that only 50,000 tonnes of waste material had spilled into waterways that connect to the Kafue River, near the northern city of Kitwe. But a South Africa-based environmental company that said it was contracted by Sino-Metals to investigate the extent of the spill found that the disaster resulted in the release of 1.5 million tonnes of toxic material. After its two-month investigation, Drizit company said approximately 900,000 cubic metres of toxic tailings were still present in the environment. \"These materials were found to contain dangerous levels of cyanide, arsenic, copper, zinc, lead, chromium, cadmium, and other pollutants posing significant long-term health risks, including organ damage, birth defects, and cancer,\"the company said in a report last month. Sino-Metals disputed the accuracy of Drizit's findings and in a statement to The Associated Press said that it had terminated its contract with the company, citing \"contractual breaches\". Atravel advisory by the Finnish government last monthshowed that water samples from the area of the acid spill contained 24 different heavy metals, 16 of which, including nickel, lead, arsenic, zinc, and uranium, exceeded the safety thresholds set by the World Health Organization. The US embassy also issued a health alert, ordering the immediate withdrawal of its personnel in Kitwe town and nearby areas due to concerns of \"widespread contamination of water and soil\". However, Zambia's government downplayed the threat, saying there were no longer any serious implications for public health. Ina statementon Thursday, Human Rights Watch said the acid pollution had \"killed fish, burned maize and groundnut crops, and led to the deaths of livestock, wiping out livelihoods of local farmers\". At the time of the spill, Sino-Metals pledged to compensate the affected communities and restore the environment. While acknowledging the $580,000 (£430,000) compensation as \"a step in the right direction,\" Zambia's Vice-President Nalumango on Wednesday said the pay-out \"must be guided by thorough and independent assessment\". \"If the damage to the land and livelihoods proves to be more extensive or long-lasting than initially understood, then further compensation will be necessary and it will be pursued,\" said Nalumango in a meeting with Sino-Metals officials. Environmental activists told HRW that community members in areas affected by the pollution were still complaining of headaches, coughing, diarrhoea, and other health issues that increased after the spill. Some of those affected said they had not received the promised compensation, according to HRW. Authorities have since imposed a fishing ban on the Kafue River and deployed the air force and speedboats to drop lime to reduce acidity levels in the affected waterways. Zambia is among the world's top 10 copper-producing countries and its economy is heavily reliant on the mining sector. Additional reporting by Wycliffe Muia More about Zambia from the BBC: Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica",
  "summary": "Zambia's Vice-President Mutale Nalumango says the compensation offered to communities \"may not be all\".",
  "timestamp": "2025-09-12T15:55:31.016981"
}