{
  "url": "https://www.bbc.com/news/videos/cvgr589ygxro?at_medium=RSS&at_campaign=rss",
  "full_text": "What you need to know about Bolsonaro's coup prison sentence Former president of Brazil Jair Bolsonaro has been sentenced to 27 years and three months in prison, after he was found guilty of plotting a military coup by a panel of five Supreme Court justices. The BBC's South America correspondent Ione Wells explains everything you need to know about the case. Punches and slaps: Watch as Mexican Senate debate ends in brawl A fight erupted in the senate involving two senior Mexican politicians. Sandstorm turns skies bright orange in Peru Footage from Ica shows huge dust clouds. Hurricane Erick hits Mexico resort towns killing two Video shows communities in the affected areas dealing with flood waters and a messy clean-up. Watch: Moment people flee church as earthquake interrupts mass in Peru The 5.6 magnitude earthquake struck near Lima, Peru on Sunday morning, causing panic at the city's cathedral. Watch: Moment Chile earthquake rocks live TV show The 6.4 magnitude earthquake interrupted the broadcast, shaking the equipment in the studio. Watch: Cat caught smuggling drugs into Costa Rica prison The feline was found carrying 235.65g of marijuana and 67.76g of heroin, authorities say. Drone footage shows scale of deadly Peru landslide Two people are killed after a glacial lagoon overflowed in the Ancash region triggering a landslide. Watch: Olympic legend leaves parents in her dust at school sports day The third-fastest woman in history, Shelly-Ann Fraser-Pryce, took part in sports day at her son's school in Jamaica. Peru fisherman reunites with brother after 95 days lost at sea Watch: Fisherman reunites with brother after 95 days lost at sea Maximo Napa said he had to resort to eating roaches, birds and turtles to survive. Watch: Man survives being run over by train Surveillance footage shows the man standing up and walking away after the incident in Lima. Man arrested trying to smuggle cocaine under toupee Suspect tried to smuggle more than €10,000 of cocaine from Cartagena to Amsterdam, Colombian authorities said. Watch: Moment man vandalises ancient Incan artefact Peruvian police released footage showing a suspect pounding Cusco's 12-Angle Stone. Peruvian policeman in capybara costume makes Valentine's drug bust Video shows the moment police use fancy dress to carry out a drug raid in Lima, Peru. Watch moment man is swallowed by humpback whale Dell Simancas captures the moment his son, Adrián, is swallowed and spat out by a humpback whale. Watch: Argentina canal turns bright red, alarming locals The body of water runs through industrial areas on the outskirts of Buenos Aires. Watch: Firefighters rescue riders from Chilean Ferris wheel Firefighters in Viña del Mar rescued more than 35 revellers trapped aboard a malfunctioning Ferris wheel. Watch: Huge waves strike Peruvian coastline Videos show waves reported to be up to four metres high upending boats and deluging towns. Watch: Abseiling Santa descends from Guatemala bridge to deliver toys A firefighter dressed as Santa abseils down a bridge in Guatemala City to give gifts to children. Watch: Police officer dressed as the Grinch leads drug raid An officer in Peru smashed a suspected drug dealer's door in, while clad as Dr Seuss' famous character.",
  "summary": "The former president of Brazil has been sentenced to 27 years in prison after being found guilty for plotting a military coup. ",
  "timestamp": "2025-09-12T15:55:33.983555"
}