{
  "url": "https://www.bbc.com/news/videos/czewd31724lo?at_medium=RSS&at_campaign=rss",
  "full_text": "'Looks like a toy, but it's real': BBC examines a downed Russian drone At least three Russian drones were shot down in Poland's airspace during attacks on Ukraine, the Polish prime minister said on Wednesday. The BBC's Sarah Rainsford has been looking at the exact type of Russian drone that flew into Poland, and is proving a massive challenge for Ukraine's territorial defence forces. Inside Kyiv government building hit by missile strike The BBC's Sarah Rainsford says Sunday's attack caused \"a huge amount of damage\". Watch: BBC at the scene of Ukrainian government building strike One of Kyiv's main government buildings was hit in overnight missile and drone strikes by Russia. 'The hit was very hard': Eyewitness in second carriage shares video of crash moment The incident in Lisbon's funicular has left 16 dead and multiple injured. Watch: BBC correspondent at scene of Lisbon funicular crash Local media reports suggest a cable came loose along the railway's route, causing it to lose control - a national day of mourning is being observed Watch: The best looks from the Venice red carpet so far Actor Julia Roberts makes her Venice Film Festival debut promoting her new movie After The Hunt. BBC reports from scene of deadly Russian attack on Kyiv Russia launched a major attack on Ukraine's capital in the early hours of Thursday evening, killing at least 19 people, including four children. Watch: Thousands have tomato fight at La Tomatina Festival Tomatoes not fit for consumption are thrown at each other during the festival. Ukraine's naval band joins Scots Guards for joint performance The two military bands were playing at Buckingham Palace to mark the the 34th Independence Day of Ukraine. French helicopter crew survive crash into lake The helicopter was attempting to collect water to fight wildfires at the time of the crash. 'Give it a go!': Tips from a top rate tree hugger Top tree hugger Hannah Willow explains why she loves the sport so much. Watch final trip for church on wheels as it moves to new home It took two days to move the church in Sweden's Kiruna, which was at risk at risk from ground subsidence. 'You look fabulous': Reporter compliments Zelensky on his suit There was a lighthearted moment when the Ukrainian president was complimented on his suit, by both President Trump and reporter Brian Glenn. Protesters target Serbian ruling party offices in fifth night of demonstrations Offices belonging to President Aleksander Vučić's political party were vandalised during the fifth consecutive night of unrest. Wildfires rage in Spain and Portugal as heatwave continues Thousands of firefighters have been battling huge blazes in Spain and Portugal on Saturday. The president's path to Alaska – how Trump's positions on Ukraine shifted BBC Verify's Nick Beake looks at what President Trump has said and done in his search for an end to the conflict in Ukraine. Firefighters battle wildfires in Spain Spanish firefighters were battling wildfires in the Leon province of Spain. Watch: Passengers escape car hit by drone in Russia CCTV captured the moment a car was hit by a Ukrainian drone in the Russian city of Belgorod, governor Vyacheslav Gladkov said in his official Telegram channel. Watch: Wildfire approaches horse enclosure in Greece At least three people have also died in Spain, Albania and Turkey as wildfires wreak havoc. Watch: Europe's wildfires seen from above Aerial video shows the extent of devastation caused by wildfires in a number of European countries. Flames near Madrid as wildfires burn across Spain and Portugal Emergency crews are battling wildfires as a record-breaking heatwave continues across Europe.",
  "summary": "Drones like this one were shot down over Polish airspace in the early hours of Wednesday.",
  "timestamp": "2025-09-12T15:55:33.874506"
}