{
  "url": "https://www.bbc.com/news/articles/cx25414vg7lo?at_medium=RSS&at_campaign=rss",
  "full_text": "France suspects foreign intelligence over pigs heads left outside mosques French police suspect that people who put pigs' heads outside Paris mosques on Monday night were acting under orders from a foreign intelligence service, probably Russian. The heads were found on Tuesday morning outside nine mosques in central Paris and surrounding suburbs, prompting a wave of outrage and condemnation. But investigators have now said the two people involved drove a Serb-registered car, used a Croatian mobile telephone, and crossed into Belgium a few hours later. The incident has striking similarities with other recent provocations – notably the daubing ofStars of David on Paris wallsin October 2023, and the painting of red hands on the city's Holocaust memorial in May 2024. Police identified a Moldovan connection in the first case, and in the second four Bulgarians are due to stand trial in October. The prosecutor in the red hands affair said it appeared \"to be an attempt to destabilise France orchestrated by Russian intelligence\". Russia and Iran have both been named by French intelligence as countries liable to provoke dissension in France through \"dirty tricks\". Police investigating the latest affair told media that they were approached by a Normandy farmer who said he had sold \"about 10\" pigs' heads to two men driving a Serbian-registered car. The same car was seen in CCTV footage in the Oberkampf region of eastern Paris on Monday evening, and then again near some of the mosques. Police said tracing of the Croatian mobile phone showed the car crossing into Belgium early on Tuesday morning. Video footage obtained by news channel BFMTV shows a man in a white T-shirt, cap and surgical mask placing a pig's head outside a mosque in the south-western suburb of Malakoff. He is seen taking a photograph before leaving, carrying a rucksack. At roughly the same time another person is seen doing the same at a mosque in the eastern suburb of Montreuil. In the Stars of David affair, the perpetrators were also seen taking photographs of their work – an act interpreted as a way of proving they had done what they were paid to do, but also to form the basis of a subsequent social media campaign. Two other incidents in the past year have interested investigators. In June 2024 stencilled images of coffins, some with wings, were found on Paris walls, with tags saying \"Stop the deaths now\" and \"Mirages [jets] for Ukraine.\" Around the same timefive actual coffins draped in French flagswere deposited in front of the Eiffel Tower, with a label reading \"French dead in Ukraine\". In both cases, French police have identified suspects of Moldovan origin. An intelligence report attached to the prosecution's file in the red hands case says that Russian intelligence has a strategy aimed at \"distributing false information and dividing French opinion or sharpening internal tensions\". They do this by \"using proxies – that is to say people who do not work directly for the [Russian] intelligence services but who carry out ad hoc tasks paid for by intermediaries, largely based in countries neighbouring Russia\". French intelligence agency Viginum, which monitors social media, said it had evidence of social media accounts linked to Russia spreading reports of the red hands affair, using thousands of fake accounts on X. https://www.bbc.co.uk/news/world-europe-67360768 Russia link suspected in Eiffel Tower coffin mystery French urged to watch out for Russian interference",
  "summary": "Foreign nationals are blamed for the incident, which has striking similarities with other recent provocations.",
  "timestamp": "2025-09-12T15:55:30.914281"
}