{
  "url": "https://www.bbc.com/news/articles/c1kwepevkzxo?at_medium=RSS&at_campaign=rss",
  "full_text": "Fatal dam collapse: 'How do you restart from nothing?' The threat of flooding once again looms over the city of Maiduguri, in north-eastern Nigeria, a year after torrential rains and the collapse of a dam left entire neighbourhoods submerged in water. For many residents who are still bearing the scars of last year's floods, the possibility of a repeat has created huge unease. At least 37 people died in the floods and two million had to abandon their houses after the widespread destruction of homes, farms and businesses. Forty-two-year-old Sa'adatu Dahiru lost her two-year-old son. \"He died as a result of hunger and fever during the flood. We had no proper food, no medicine, and no safe place to stay.\" She told the BBC how her children cried and they had to rush out in the middle of the night carrying \"only a few clothes\", leaving everything else behind. She says she did receive some state support of 10,000 naira ($7; £5) when the flood happened. However the mother of six says government assistance has since halted: \"Since then, none of the other promises from the government have reached us. We are still waiting, still suffering.\" The Borno state government says it has supported local communities impacted by the disaster. It cites the establishment of relief camps and food aid as well as cash handouts. More significantly, the government has begun reconstructing the dam and dyke system at Alau - on the outskirts of Maiduguri - which caused the flooding. Construction of the dam started in 1986 and it is maintained by the Chad Basin Development Authority (CBDA), an agency of the Nigerian government. However, more than a decade and a half of the insurgency by the Boko Haram Islamist group in the area has made it difficult to maintain the dam, Mohammed Shettima, head of the agency's engineering department, told the BBC. \"The dam is located on the fringes of the Sambisa forest – about 4km [2.5 miles] from the base of the jihadist groups,\" he explained. \"The dykes were worn and because they were not maintained, when the heavy rains came last year, the dykes gave way, releasing [the] huge volume of water that flooded the city.\" In August two soldiers were killed near the dam and four security agents were killed at the hands of people suspected to be Islamist fighters. One of the flood victims who has been affected by Islamist violence is Maryam Jidda. She escaped her hometown of Damboa with her daughter and two grandchildren after it came under attack by Boko Haram around four years ago. \"They didn't warn. They came like a dark wind in the night,\" she recalls. She thought she had found safety in Maiduguri. Then the floods came and forced her to flee for a second time. She sat on a broken block from the debris of her destroyed house with her red gown, or jilbab, draped over her head down to the ground. Eyes forlorn, the 72-year-old cut the figure of someone who had seen years of suffering and hardship. \"I stood in waist-deep water, crying,\" Ms Jidda said as she recounted the life-changing moment water rushed into her compound, before it overwhelmed her house. She is now living in temporary shelter where food is scarce and water unclean. And not only did she lose her home, but also the photographs and belongings that carried her family's memories. One year on from the floods, many residents are still living in makeshift shelters, with no homes to go to. Young people have also been particularly affected due to disruption to their education as well as the lack of jobs. Ali Kadau, 21, told the BBC the flood \"took everything\" from him. \"Before the flood, I was managing. I didn't go far in school, but I had small skills - I used to help at a mechanic workshop, fix tyres, run errands,\" he said as he sat on a broken chair, driving away a swarm of flies in the hot Maiduguri weather. Mr Kadau recalled how it started like every rainy season - the usual flooding in the streets. But this time, it didn't stop. The water started entering people's houses, and before long, the Gwange area where he lived was submerged. \"Our own house - built with mud - couldn't stand the pressure. The walls fell. Water came in, carrying away everything. Our clothes, mats, food, even my phone that I used to get customers. All gone,\" he lamented. The family slept outside for three days before they found space at a nearby school turned shelter. There was no privacy, no comfort, just bodies lying side by side. The mechanic shop he was working at was also affected - water destroyed the tools and machines. \"Now, I just sit around. No job. No school. No money to start anything. Sometimes I help push wheelbarrows in the market just to eat. Other days, I do nothing but think,\" he said. Borno Governor Babagana Umara Zulum described the flood response as a daunting task, especially considering the state's 16-year struggle with violent extremism. \"We set up a committee with specific terms of reference,\" he said, adding that the members worked tirelessly to ensure affected families received adequate support, including shelter and food. Finding shelter for two million people in Maiduguri, a city already hosting over a million people who had fled Islamist attacks, was a significant challenge. \"The government's priority was to stop water overflow, which helped prevent the city from completely submerging. This was achieved through desilting rivers and constructing new [drainage],\" he said. According to the committee's report, a total of 28.2bn naira ($18m; £13m) was raised through a combination of national and state governments, along with aid agencies such as the UN refugee agency and the World Food Programme. A significant amount of the money was reportedly distributed to more than 100,000 households, alongside food and non-food items. Additional support included financial assistance to more than 7,000 traders in affected markets, as well as to places of worship and private schools. As part of the reconstruction and recovery activities, Borno has requested an additional 61bn naira to rebuild damaged infrastructure, including bridges, road networks and hospitals. However, there is a danger that such a large sum of money won't be approved unless there is another disaster. Some funds have also been approved for the rehabilitation and upgrade of boreholes across Maiduguri and surrounding communities to address water scarcity caused by the flood. As the rainy season heads towards its climax this September, for people like Ms Dahiru, the question is simple: \"How do I start again when I have nothing?\" While Ms Jidda is still grieving. She had 10 children. Only three survived. \"There's nothing left but memories and pain.\" Additional reporting by Chigozie Ohaka and Gift Ufuoma More Nigeria stories from the BBC: Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica",
  "summary": "Survivors of the flood tell the BBC they are still in need of government support.",
  "timestamp": "2025-09-12T15:55:33.572203"
}