{
  "url": "https://www.bbc.com/news/articles/c5yqendv7k5o?at_medium=RSS&at_campaign=rss",
  "full_text": "From political outsider to a president like no other: Bolsonaro's rise and fall In September 2018, as Jair Bolsonaro campaigned in the south-eastern city of Juiz de Fora, a 40-year-old man pushed through the crowd and stabbed the presidential candidate in the stomach. Images of Bolsonaro doubled over in pain, wearing a T-shirt in Brazil's football colours, were shared millions of times and broadcast endlessly on television. The former army captain survived, and the shock and commotion caused by the attack boosted his outsider image and helped carry him to victory weeks later. Seven years on, Brazil's Supreme Court has found him guilty of plotting a coup and sentenced him to more than 27 years in prison. On the face of it, Bolsonaro's career is over. However, he remains one of the most consequential politicians of recent decades, and with allies already pushing for amnesty, his influence and even the prospect of a comeback still hangs over Brazil's future. The long road to power Because of his inflammatory rhetoric, Bolsonaro was never taken seriously by most of Brazil's political establishment before becoming president. In July 2018, three months before the election, I was BBC Brasil's São Paulo bureau chief. In conversations with pollsters, politicians and business leaders, the consensus was clear: despite leading in most polls, Bolsonaro could not win; he lacked the machinery of a major party and his support would quickly fade once television campaigning began. Bolsonaro was a former army official, who left the forces after campaigning for higher military pay and being accused - then acquitted - of plotting a bombing as part of salary protests in the 1980s. He then began a three-decade career as a congressman, building a persona on incendiary statements and defence of the military dictatorship that ended in 1985. For decades, he was a constant presence on television talk shows where he railed against democracy and praised authoritarian rule. In a 1999 interview, he said that as president, he would stage a coup on his first day and \"finish the work\" of the dictatorship by killing 30,000 people. The first, he said, would be the then-president, Fernando Henrique Cardoso. All through his seven terms in Congress, Bolsonaro remained on the fringes of Brazil's political establishment - an outsider. But in 2018, Brazilians were hungry for just that. The country had endured five years of turmoil: mass protests in 2013, a deep recession, the impeachment of President Dilma Rousseff in 2016, and the sweeping \"Car Wash\" investigation. That probe implicated politicians across the political spectrum, but hit hardest the Workers' Party (PT) of Rousseff and Lula, who had governed Brazil from 2003 to 2010. In April 2018, Lula - the immensely popular former president who had left office with approval ratings above 80% - was jailed on corruption charges later annulled by the Supreme Court. To many Brazilians, every politician seemed compromised. Bolsonaro saw his opportunity. Mostly through social media, he managed to gather a broad coalition; the middle and lower-middle classes frustrated with the PT and the sense of widespread corruption; a conservative evangelical community that already represented more than 26% of the population; elements of the police and military; far-right militants; business sectors dissatisfied with the economy; and - probably most important - millions of ordinary Brazilians who simply believed it was time for a change. In October 2018, that coalition turned out in force to vote him into power. His presidency looked nothing like any Brazilian government since the country's return to democracy in the 1980s. An outsider who changed everything Bolsonaro managed to turn the Brazilian right into a mass movement for the first time in history. Yet translating that into a government was another story. He assembled a cabinet with little experience in federal administration and leaned heavily on military officers to fill key posts. His administration was pro-business, and aligned itself diplomatically with Donald Trump's United States - who Bolsonaro hailed as an inspiration - and with other conservative governments in Hungary and Israel. He weakened oversight and relaxed protections on the environment that favoured agribusiness. The result was a surge in deforestation in the Amazon and other areas - sparking international anger. But the real challenges came with the pandemic in 2020. From the beginning, Bolsonaro opposed social distancing, arguing it would damage the economy. On several occasions, he joined mass demonstrations where advice to wear masks and distance was openly defied. In March 2020, he compared Covid-19 to a \"little flu\". And in the following month, when asked about the mounting death toll, he replied simply: \"I'm not a gravedigger\" - a remark he later admitted regretting. Bolsonaro was also a vaccine sceptic, resisting offers to buy jabs for his population and refusing to get one himself. In defiance of his own health officials, he promoted unproven treatments such as hydroxychloroquine. Eventually, vaccines became available. But many specialists believe that thousands of lives could have been saved if the government had adopted social distancing measures and immunised earlier. In total, more than 700,000 Brazilians died of Covid-19 between 2020 and March 2023. The president's nemesis More than any opposition party, Bolsonaro's most formidable foe during his presidency was the Supreme Court, which struck down his attempts to block social distancing and mask use during the pandemic, and also rejected policies that would have made it easier for Brazilians to acquire firearms. One judge became his nemesis: Alexandre de Moraes. A career public prosecutor and law professor, he had served in conservative administrations in São Paulo before being appointed to the court by centre-right President Michel Temer, who succeeded Rousseff. In 2020, Moraes was appointed to lead an inquiry into the spread of disinformation on social media that targeted his court. That later branched into other cases, including one focused on threats against democracy by Bolsonaro supporters. All were kept under Moraes's supervision. Such a concentration of power became a point of criticism, not only from Bolsonaro loyalists but also from some lawyers and centrist politicians. Moraes's role, however, was grounded in law and most of his decisions were later upheld by the rest of the Supreme Court. For some analysts and commentators, entrusting him with this task was seen as the only way to safeguard Brazil's democracy. However, Bolsonaro's dissatisfaction only grew, and on many occasions he declared that he would not comply with the court's rulings. At mass demonstrations in Brasília and São Paulo in September 2021, he escalated his attacks, calling Moraes acanalha(scoundrel) and declaring that he would only leave the presidency \"arrested, dead, or victorious\", adding that he \"wanted to tell the traitors that I will never be arrested\". The speech was widely seen as a direct threat to Brazil's democratic institutions. Conspiracy and election controversy In 2021, Lula - who had left jail in November 2019 and had all charges against him annulled by the Supreme Court - was cleared to run in the October 2022 election, setting up a head-to-head with the incumbent. Bolsonaro and his allies began an intense campaign alleging - without evidence - that the country's electronic voting machines could be hacked. Bolsonaro claimed that Lula could only win against him through fraud. The campaign was widely seen as an effort to lay the groundwork to contest any result that went against him. Bolsonaro insisted on paper ballots only for the election, and suggested he would reject any result without them. Electoral authorities rejected the proposal. There were further controversies during voting. On the day of the run-off between Bolsonaro and Lula, the federal road police - under Bolsonaro's government - set up roadblocks in areas where Lula had strong support. The government claimed it was to prevent fraud, but it was widely seen as an attempt to stop Lula's supporters from reaching the polls. It was Moraes, the Supreme Court justice, who ordered the roadblocks lifted and threatened to jail the police chief if they continued. In the end, as most polls had predicted, Lula won - but by a very slight margin of less than two percentage points. Obstinance turns to violence In the aftermath of the election, Bolsonaro remained silent and out of public view. When he finally spoke, it was only briefly. He did not acknowledge defeat - something that he would never do - but authorised the start of the transition. At the same time, instigated by the president, his supporters were using lorries to block roads across Brazil, while hundreds of Bolsonaro loyalists camped outside army barracks demanding that the election be annulled and the armed forces intervene to prevent Lula's inauguration. Later investigations showed that, during this period, Bolsonaro met military leaders to discuss imposing a state of emergency to overturn the election. The plan did not proceed because two of the three military chiefs refused to take part, according to statements they gave under oath. Police later discovered that a plan to assassinate Lula and Moraes had been printed by one of the president's aides inside the presidential palace. Bolsonaro denies any knowledge about the plans and argues that he only discussed Constitutional measures with military chiefs – although Brazilian law does not allow for a state of emergency to be declared in order to annul an election. In the final days of 2022, while still president, Bolsonaro flew to Florida and did not return to attend Lula's inauguration on 1 January, 2023 - breaking a tradition in which the outgoing president hands the presidential sash to his successor. On 8 January, Brazil witnessed something unprecedented: thousands of Bolsonaro supporters stormed Congress, the Supreme Court and the presidential palace in Brasília, in what looked like a tropical version of the US Capitol attack. Lula was not at the palace, and security forces brought the riot under control by the end of the day. Bolsonaro, still in the US, denied involvement - although a majority of Supreme Court justices later saw the assault as part of a broader plan to remove Lula. The end of the line... for now Bolsonaro eventually returned to Brazil and set about regrouping his allies, aiming not only at the 2026 presidential race but also at other spheres of power. In the 2024 local elections, his party won more than 500 mayoralties across Brazil. At the same time, investigations against him led by the federal police under the scrutiny of Moraes were gathering pace and, in April of 2025, the Supreme Court scheduled his trial. Denouncing the lawsuit as political persecution, one of Bolsonaro's sons, Congressman Eduardo Bolsonaro, moved to the US to lobby the new Trump administration and his Make America Great Again movement for measures against Brazil. In July, Trump imposed 50% tariffs on Brazilian goods, and claimed Bolsonaro was the victim of a witch hunt. Soon after, an investigation was launched in Brazil into Eduardo and Jair Bolsonaro for interference into the judicial process due to their approach to the US government. In August, Bolsonaro was placed under house arrest. The former president was eventually convicted by the Supreme Court on all five charges of which he had been accused, including plotting a coup and leading an armed conspiracy. He is now barred from running for any public office until 2060. The verdict, though, might not be a dead end for Bolsonaro. Even before the trial ended, his allies in Congress began negotiating a proposal of amnesty for his crimes that could be voted in the next few weeks. At the same time, politicians who seek his endorsement for their presidential bids are already promising to pardon Bolsonaro if they win. A secretary in the Lula administration, who spoke on condition of anonymity, warned that any amnesty approved by Congress would be declared unconstitutional by the Supreme Court - a scenario that could trigger a crisis if Bolsonaro's allies manage to elect a large number of senators and deputies who could even attempt to remove Supreme Court justices. As one lawyer said during this month's trial, \"everybody knows that any decision will be revisited. Nothing will be permanent.\" The statement sounds like an omen and a definition of Brazil's recent history.",
  "summary": "The Brazilian ex-president has been sentenced to 27 years for plotting a coup, but an amnesty could be on the cards.",
  "timestamp": "2025-09-12T15:55:31.200968"
}