{
  "url": "https://www.bbc.com/news/articles/c4g2z8nv344o?at_medium=RSS&at_campaign=rss",
  "full_text": "Party like it's 2018 - Ethiopians celebrate their new year Ethiopia is celebrating the start of its new year - 2018. The country has its own unique calendar, meaning it is seven years behind the Western calendar. These yellow \"adey ababa\" blooms are associated with the celebration. They grow wild around the capital, Addis Ababa, at this time of year. Small bunches have been selling for around 50 Ethiopian birr ($0.35; £0.25). The seven-year gap comes down to the fact that the birth year of Jesus Christ is calculated differently in Ethiopia. When the Catholic Church amended its calculation in 500 AD, the Ethiopian Orthodox Church did not. But the celebrations - known as Enkutatash - are not tied to the church, and for everyone in the country it is a time to celebrate. Here vendors in Addis Ababa come in from the countryside to sell adey ababa and also freshly cut grass - both of which are used during traditional coffee ceremonies. The birthplace of coffee is widely considered to have been in the highlands of Ethiopia. The grass and flowers are used as decoration for the ceremonies during which the beans are roasted over an open fire, ground and then brewed in a clay pot. Shopping areas, including the market of Addisu Gebeya, were heaving in Addis Ababa on New Year's Eve, despite the rain - as people rushed to prepare for the celebrations. This is 19-year-old Tamirat Dejene, who came to Addis Ababa from the small town of Chancho, about 40km (25 miles) north of the city, to sell his chickens. He told the BBC he was doing a roaring trade - with hens selling for between 2,000 birr ($14; £10) and 3,000 birr. Chickens are preferred for those cooking up a New Year's feast on a budget. They make a spicy stew called \"doro wat\", which is served with injera - a traditional fermented pancake-like flatbread. For those with more money, mutton is on the menu - usually roasted. These sheep, decorated in celebratory ribbons by their owner, were selling for between 15,000 birr ($105; £77) and 22,000 birr. Families tend to gather and invite friends to join them for a Enkutatash meal either at lunch or in the evening - or both. Some even slaughter an ox, which can cost up to 300,000 birr ($2,000; £1,550). On New Year's Eve everyone rushes to finish their shopping and then in the evening they head off to see concerts and live bands. Here some of the bigger venue concerts are advertised. I ended up at a hotel lounge in Addis Ababa, where a live band welcomed in 2018 with music and sparklers at midnight. On New Year's Day morning a traditional song known as \"Abebayehosh\" is heard around the city - usually performed by young girls for passers-by. In some neighbourhoods they go door-to-door. The song is deeply rooted in Ethiopian culture and captures the spirit of the new year. Orthodox Christians continue in that spirit later in the day with church services. Here vendors have set up a stall to sell ceremonial umbrellas near a church in the city. A priest joins the congregation at Addis Ababa's Entoto St Raguel Church on Thursday morning to offer up prayers for the year ahead. People in Ethiopia have no difficulty switching between the two calendars - when they talk in local languages the year is 2018, but in English they automatically jump forward to 2025. Another unusual aspect of the Ethiopian calendar is that it has 13 months. The first 12 have 30 days and this year the 13th month had just five days (on a leap year it is six). The time of year also marks an end to the rainy season, the start of spring and festivities marking a season of renewal and optimism. This year there has been a greater sense of unity and pride as the week began with the formal launch of the Grand Ethiopian Renaissance Dam (Gerd), which has been built on a tributary of the River Nile. You may also be interested in: Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica",
  "summary": "Photos of new year celebrations in a country with a calendar seven years behind that followed in the West.",
  "timestamp": "2025-09-12T15:55:31.763831"
}