{
  "url": "https://www.bbc.com/news/articles/c5yg0ly2nlko?at_medium=RSS&at_campaign=rss",
  "full_text": "Dutch broadcaster says it will join Eurovision boycott over Israel The Dutch public broadcaster, Avrotros, has confirmed the Netherlands will also boycott next year's Eurovision song contest if Israel is involved. It follows Irish broadcaster RTÉ, which has saidit will not take part if Israel does\"given the ongoing and appalling loss of lives in Gaza\". Eurovision will take place next in May 2026 in Vienna afterAustrian singer JJ won this yearfollowing a nail-biting finish that saw him topple Israel from pole position at the very last minute. Ina statementwhich echoed RTÉ's, Avrotros said it too could no longer justify Israel's inclusion \"given the ongoing and severe human suffering in Gaza\" and the \"serious erosion of press freedom\". It continued: \"Human suffering, the suppression of press freedom and political interference are at odds with the values of public broadcasting.\" The Dutch broadcaster went on to cite the Israeli ban on international media from entering war-torn Gaza, as well as the \"many casualties among journalists\". On Friday, Irish musician and songwriterPhil Coulter called on the UK to withdraw from Eurovision 2026 if Israel participates. The BBC - the UK's Eurovision broadcaster - has so far declined to comment. Mr Coulter said he was \"100% behind RTÉ\" in their decision to withdraw from the contest, and that people in the UK and Ireland are both \"disgusted by what's going on in Gaza\". Coulter has written or co-written several songs for Eurovision, including the UK's 1967 winning song, Puppet on a String, which singer Jade Thirlwall sampled last year. RTÉ said it will make a final decision once the Eurovision organiser, the European Broadcasting Union (EBU), has done so. Earlier this year, more than 70 former Eurovision contestants signed a letter calling on the organisers to ban Israel from the 2025 competition. UK should withdraw from Eurovision if Israel takes part - Phil Coulter Ireland threatens to withdraw from Eurovision if Israel participates",
  "summary": "The Netherlands follows Ireland in saying it can \"no longer justify Israel's inclusion\" in the event.",
  "timestamp": "2025-09-12T15:55:30.649497"
}