{
  "url": "https://www.bbc.com/news/articles/c8d793z4mzgo?at_medium=RSS&at_campaign=rss",
  "full_text": "Man accused of Trump assassination attempt cut off by judge as trial begins Minutes into his opening statement, Ryan Routh, the man accused of trying to assassinate US President Donald Trump last September, was forced by the judge to end his remarks. Introductory statements are typically used to preview evidence and arguments for the rest of trial. But Mr Routh's were dedicated to his philosophical musings on intent, the history of human evolution, the \"need to be kind to one another\" and beauty found in \"hearthstones worn smooth\" by generations of children. He invoked Adolf Hitler and Vladimir Putin, and declared: \"Modern trials seem to eliminate all that is human.\" US District Judge Aileen Cannon interrupted Mr Routh three times to remind him of proper procedure and reprimand him for \"making a mockery of this court\". At one point, the Trump appointee excused the jury while she chastised him, before finally suspending his remarks entirely. His truncated opening statements and frequent rebukes from the judge set the stage for an unusual - and at times uncomfortable - first day of the trial, during which the government questioned five witnesses and Mr Routh struggled to mount a coherent defence. Mr Routh, 59, is charged with five crimes including attempted assassination of a major presidential candidate and has chosen to represent himself. He has pleaded not guilty. For the prosecution, attorney John Shipley Jr said in his opening remarks that by trying to assassinate Trump in the midst of the 2024 election, Routh \"decided to take the choice away from the American people\". \"This plot was carefully crafted and deadly serious,\" Mr Shipley added. \"This case is not about whether you like Donald Trump or not,\" Mr Shipley told the jury. Instead, it was about whether Routh plotted to kill him. Mobile phone data, security footage, a handwritten note by Mr Routh stating an intention to kill Trump, plus eyewitness testimony would prove the case beyond reasonable doubt, Mr Shipley said. The first witness, Robert Fercano, was a member of Trump's Secret Service detail. He testified about how he discovered a man hiding on the perimeter of Trump's West Palm Beach golf course last September. Mr Fercano testified that while patrolling the perimeter near the sixth hole of the golf course, he saw a face, armoured plates and what appeared to be the muzzle of an AK-style weapon poking through the fence. He identified the man he discovered there as Mr Routh, who sat alone watching from the defence table wearing a gray blazer and blue tie. After calling out \"Hey, sir\", Mr Fercano said the man groaned and \"smiled at me\". But he soon noticed armour plating on the fence andrealised a weapon was pointed \"directly\" at him. He called for backup and began to move away while reporting the man. Jurors heard audio of Mr Fercano radioing colleagues after he discharged his weapon in Mr Routh's direction: \"Shots fired! Shots fired! Shots fired!\" At prosecutors' request, the agent stood before the jury holding the SKS semi-automatic rifle they allege Mr Routh obtained illegally and tried to use in the assassination attempt. Shortly after, Mr Routh began his cross-examination. \"Is it good to be alive?\" he asked the agent. He then asked a series of questions about the most likely position a person might assume if they were \"a bad guy trying to obscure myself\". \"I do know you pointed the weapon at my face,\" Mr Fercano told Mr Routh in response to questions about the positioning of the weapon. Next, prosecutors questioned Florida resident Tommy McGee, who said he saw a man he identified as Mr Routh fleeing the scene. After hearing gunshots from the road outside the golf course, Mr McGee, a mental health professional, told the jury he \"saw a man coming out of the bushes\" looking \"dishevelled, unkempt and frantic\". As the man ran across the road in front of Mr McGee's vehicle, \"we looked right at each other\", he said. Mr McGee said he decided to make a U-turn and follow the man. He ultimately captured an image of the car Mr Routh allegedly used to flee, and followed the vehicle to take down the license plate number. Authorities used that information to locate Mr Routh's vehicle heading northbound on Interstate 95, detained him, and flew Mr McGee there in a helicopter to identify him. The jury viewed a dashcam video of Mr McGee in a law enforcement vehicle on 15 September 2024 as he identified the man police had detained on the highway as the man who ran in front of his car. Rather than question Mr McGee during cross examinations, Mr Routh instead told him: \"You're my hero. You're a good man.\" \"I celebrate your efforts,\" Mr Routh said. Prosecutors called three more witnesses on Thursday: another US Secret Service agent who responded to the assassination attempt, and two FBI agents involved with holding and processing Mr Routh. A man and a woman who identified themselves to the BBC as Mr Routh's children watched the proceedings from the back of the courtroom.",
  "summary": "Ryan Routh, who is defending himself, was reprimanded by the judge for \"making a mockery\" of the court.",
  "timestamp": "2025-09-12T15:55:29.583909"
}